{"title": "Texas AG fires back at Biden admin's 'absurd lawsuit' over redistricting", "text": "All of the government agencies are nothing but cartels and cabals now used to attack the will of the people and ensure federal power. There's a war going on between the federal government and states. Thanks Obama.", "label": 0, "succ": "Actually one man ran on draining that swamp and apparently only made it deeper. Enjoy that IRS audit that all Republicans will be getting very soon.", "meta": "", "user": "skarekrow", "mentions": "", "prev": ""}
{"title": "Texas AG fires back at Biden admin's 'absurd lawsuit' over redistricting", "text": "Welcome to Federal overreach. I hope this goes to the SCOTUS.", "label": 0, "succ": "SCOTUS will kick the can down the road. They don't do anything but moderate/boring decisions these days.. god forbid they'd do anything for the 2a such as abolishing the NFA.", "meta": "", "user": "wakeupamerica!679", "mentions": "", "prev": ""}
{"title": "Texas AG fires back at Biden admin's 'absurd lawsuit' over redistricting", "text": "How else could a creature like Maxine Waters get elected to anything?", "label": 1, "succ": "", "meta": "", "user": "lambdaman", "mentions": "", "prev": "Let he who is without guilt cast the first stone.  Every Democrat controlled state has gerrymandered the voting districts to favor their party.  The Republican controlled State are no different in that regard.  Every election for Congress and Senate should be Statewide elections.  Let everyones vote count.  Politics like life is a series of choices.... If you don't like your life, make better choices."}
{"title": "Texas AG fires back at Biden admin's 'absurd lawsuit' over redistricting", "text": "The lawsuit is a joke.  No Branch of the federal government has any authority over state redistricting even through a back door.", "label": 0, "succ": "I believe the purpose of the lawsuit is just to form a political narrative.", "meta": "", "user": "caspiansails", "mentions": "", "prev": ""}
{"title": "Texas AG fires back at Biden admin's 'absurd lawsuit' over redistricting", "text": "I do not care for Mitch McConnell at all. But the best thing he has ever done is not getting Merrick Garland on the Supreme Court.", "label": 0, "succ": "", "meta": "", "user": "Batman77534", "mentions": "", "prev": ""}
{"title": "Texas AG fires back at Biden admin's 'absurd lawsuit' over redistricting", "text": "Really, biden got more votes than ANY president in history, You have to believe that!  Most of those votes came after midnight, You have to believe that!", "label": 0, "succ": "", "meta": "", "user": "brucegordon", "mentions": "", "prev": ""}
{"title": "Texas AG fires back at Biden admin's 'absurd lawsuit' over redistricting", "text": "There is NO way in hades FJB got more “legal” votes in history. Hardly anyone even showed up for his rallies. Well, most of the time he pitifully rallied from his basement while screwing up what was on the teleprompter. President Trump had thousands at every rally. If that’s not Democrat corruption I don’t know what is. NO one will ever convince me FJB won the election fair and square. NEVER!!!", "label": 1, "succ": "", "meta": "", "user": "", "mentions": "codeo", "prev": ""}
{"title": "Texas AG fires back at Biden admin's 'absurd lawsuit' over redistricting", "text": "Career voting rights experts? Give me a break! There is no such expert in Washington bureaucracy.", "label": 0, "succ": "From the office president elect...who knows what future nonsense will spew from this administraition.", "meta": "", "user": "yousaidwhat!", "mentions": "", "prev": ""}
{"title": "Texas AG fires back at Biden admin's 'absurd lawsuit' over redistricting", "text": "Joey has politicized every Federal agency to use against Republicans.  A clear sign of a Dictatorship forming.", "label": 0, "succ": "Democrats have been doing it forever.  FDR and LBJ were experts at it!  But Obama had all these extra-governmental institutions to work with like the Dept of Education, EPA, Dept of Energy, etc...", "meta": "", "user": "vp1229", "mentions": "", "prev": ""}
{"title": "Texas AG fires back at Biden admin's 'absurd lawsuit' over redistricting", "text": "Redistricting is a big issue in my state of Ohio as well. When Democrats are in charge, redistricting is looked upon as a haven of democracy. But, when Republicans are in charge of redistricting, it becomes a violation of voting rights and hurts minorities when it comes to having representation in Congress.", "label": 0, "succ": "Every single time, Trot out the same argument. It’s wrong, well used and a lie.", "meta": "", "user": "newsguy55", "mentions": "", "prev": ""}
{"title": "Texas AG fires back at Biden admin's 'absurd lawsuit' over redistricting", "text": "Thank God Merrick Garland didn't make it to the Supreme Court.", "label": 0, "succ": "", "meta": "", "user": "jcook1012", "mentions": "", "prev": ""}
{"title": "VP Harris sits down for image-boosting interview amid reported office turmoil", "text": "And when something comes to you, you are to handle it efficiently and effectively.  So far, we've seen little to no efficiency or effectiveness.", "label": 0, "succ": "And you know that she blames those that are leaving for her disapproval numbers. It's always someone else's fault with Democrats. FJB!", "meta": "", "user": "RTrim", "mentions": "", "prev": ""}
{"title": "VP Harris sits down for image-boosting interview amid reported office turmoil", "text": "Shouldn't she be doing something more important than an interview to boost her image, like maybe actually doing her job? I was always taught that I would be judged by my actions not how I look!", "label": 0, "succ": "", "meta": "", "user": "rpthinker", "mentions": "", "prev": ""}
{"title": "VP Harris sits down for image-boosting interview amid reported office turmoil", "text": "She loves people the same way Jeffrey Dahmer did.  Chew 'em up then spit them out.", "label": 1, "succ": "", "meta": "", "user": "howdydoody421", "mentions": "", "prev": ""}
{"title": "VP Harris sits down for image-boosting interview amid reported office turmoil", "text": "Your love for people is not reciprocated. But then it's also not real. As for her relationship with Brandon, it's pretty much the same as the relationship between two non-swimmers desperately dragging each other down to a watery death.", "label": 0, "succ": "", "meta": "", "user": "november_road", "mentions": "", "prev": ""}
{"title": "VP Harris sits down for image-boosting interview amid reported office turmoil", "text": "She was to find out the root cause of the border crisis and she did. She found that there were too many people down there trying to cross at the same time. Good job, Kamala!", "label": 0, "succ": "", "meta": "", "user": "GaryGary", "mentions": "", "prev": ""}
{"title": "VP Harris sits down for image-boosting interview amid reported office turmoil", "text": "She is totally unqualified for the position of Vice President, Senator, or even Representative of the United States.", "label": 0, "succ": "", "meta": "", "user": "fernanditousa", "mentions": "", "prev": ""}
{"title": "VP Harris sits down for image-boosting interview amid reported office turmoil", "text": "Harris is grossly incompetent and MUST resign, Biden was elected as the Elites financed his campaign so the Americans who are unable to comprehend would vote for Biden and a worthless questionable VP. Why, they want to destroy Capitalism and replace it with Socialism/ New World Order. ", "label": 1, "succ": "", "meta": "", "user": "lssconservative", "mentions": "", "prev": ""}
{"title": "VP Harris sits down for image-boosting interview amid reported office turmoil", "text": "Kamala has dropped more boxers than Mike Tyson.", "label": 1, "succ": "", "meta": "", "user": "gearhed750", "mentions": "", "prev": ""}
{"title": "VP Harris sits down for image-boosting interview amid reported office turmoil", "text": "Save her rep? Ha! She didn't get the nickname 'Heels Up' because she was a stellar DA or Senator.", "label": 1, "succ": "", "meta": "", "user": "redryder996", "mentions": "", "prev": ""}
{"title": "De Blasio on signing noncitizen voting bill despite 'big legal questions': My focus is on COVID", "text": "The only people who should be voting are legal citizens.  If I lived there (which thankfully I don't), I'd be suing for then allowing a non-American to cancel out. my vote.", "label": 0, "succ": "", "meta": "", "user": "The_truth691", "mentions": "", "prev": ""}
{"title": "De Blasio on signing noncitizen voting bill despite 'big legal questions': My focus is on COVID", "text": "Let the lawsuits begin! This illegal tactic by those who purported to have NYCs interests have shown nothing but divisiveness.  This action needs to be shutdown in the courts.", "label": 0, "succ": "", "meta": "", "user": "conserv911", "mentions": "", "prev": ""}
{"title": "De Blasio on signing noncitizen voting bill despite 'big legal questions': My focus is on COVID", "text": "Did I hear that right? Even though the non-citizen bill is illegal, I'm signing it anyway. Why sign it if there is any question on it's legitimacy? The Democrats will use any trick to throw the next Presidential election.", "label": 0, "succ": "", "meta": "", "user": "billyzee", "mentions": "", "prev": ""}
{"title": "De Blasio on signing noncitizen voting bill despite 'big legal questions': My focus is on COVID", "text": "De Blasio is one of the most corrupted evil men in America. The fight has to go to them. We have to fight back. Whether it's on the streets or at The Ballot Box the fight has to be taken to them", "label": 1, "succ": "", "meta": "", "user": "flyer4747", "mentions": "", "prev": ""}
{"title": "De Blasio on signing noncitizen voting bill despite 'big legal questions': My focus is on COVID", "text": "Laws have never played a role in the decision-making process of Democrats.", "label": 0, "succ": "", "meta": "", "user": "dasgoat", "mentions": "", "prev": ""}
{"title": "San Francisco's vaunted tolerance dims amid brazen crimes", "text": "In the 60’s and 70’s I loved going to SF. But since about the 80’s, I started to stay clear of it. Haven’t had any desire to go there since my last visit in the late 80’s.", "label": 0, "succ": "", "meta": "", "user": "Busterdog", "mentions": "", "prev": ""}
{"title": "San Francisco's vaunted tolerance dims amid brazen crimes", "text": "Same voters complaining about the squalor/crime in San Francisco CONTINUE to elect liberal officials whose policies create such conditions.  I have zero sympathy.", "label": 0, "succ": "", "meta": "", "user": "Stryker99", "mentions": "", "prev": ""}
{"title": "San Francisco's vaunted tolerance dims amid brazen crimes", "text": "I always thought that Smashed and Grabbed was something that happened to AOC when she had too much to drink as a bartender", "label": 1, "succ": "", "meta": "", "user": "viknat556", "mentions": "", "prev": ""}
{"title": "San Francisco's vaunted tolerance dims amid brazen crimes", "text": "Its hard to feel bad for any of the residents of San Fransisco. They have elected and put these people in charge. They have embolden them by reelecting them over and over. There just simply isn't any consequences for these politicians in the city to not do anything about any of the problems. They know that the residents will just simply reelect them regardless of what is going on. So, I just don't feel bad for them now. Live with what you created, since you won't change it.", "label": 0, "succ": "", "meta": "", "user": "Bedazzled", "mentions": "", "prev": ""}
{"title": "San Francisco's vaunted tolerance dims amid brazen crimes", "text": "I laugh at their suffering. It is genuinely entertaining. I pray they continue their pious tolerance and keep feeding the headlines.", "label": 1, "succ": "", "meta": "", "user": "undeniablefacts", "mentions": "", "prev": ""}
{"title": "Janice Dean speaks out amid reports Team Cuomo secretly plotted to discredit her: 'This won't stop my mission'", "text": "Chris Cuomo enlisted the mainstream media and New York state governors office and staff to come up with any tiny bit of ammunition from Janice Dean's past that he could possibly use to belittle or demean her and they found absolutely nothing. Thank you Janice for fighting for the most vulnerable.", "label": 0, "succ": "", "meta": "", "user": "Skinflintstone", "mentions": "", "prev": ""}
{"title": "Don't buy media hype on Newsom's gun ban, it won't work: Constitutional scholar", "text": "The only mistake the founders made on the Constitution was leaving out capital punishment for politicians that violate the 2nd Amendment.", "label": 1, "succ": "", "meta": "", "user": "Jakesaysso", "mentions": "", "prev": ""}
{"title": "Don't buy media hype on Newsom's gun ban, it won't work: Constitutional scholar", "text": "America would be a safer place if every citizen carried a gun wherever they went. It's not safe where only criminals carry guns.", "label": 1, "succ": "", "meta": "", "user": "2Patriot007", "mentions": "", "prev": ""}
{"title": "Don't buy media hype on Newsom's gun ban, it won't work: Constitutional scholar", "text": "Best part of Gavin ran down his daddy's leg ", "label": 1, "succ": "", "meta": "", "user": "snoopysails", "mentions": "", "prev": ""}
{"title": "Don't buy media hype on Newsom's gun ban, it won't work: Constitutional scholar", "text": "Can somebody sue Newsom every time a criminal escapes California and has to be stopped somewhere else?", "label": 0, "succ": "", "meta": "", "user": "stockpiled2020", "mentions": "", "prev": ""}
{"title": "Don't buy media hype on Newsom's gun ban, it won't work: Constitutional scholar", "text": "We have a pact among us.  Whenever the libs announce something like this, each of us go out and buy three weapons.  AK, AR and Sig here we come!  MAGA!", "label": 1, "succ": "", "meta": "", "user": "remember1917", "mentions": "", "prev": ""}
{"title": "Don't buy media hype on Newsom's gun ban, it won't work: Constitutional scholar", "text": "Guns don't murder babies, but Democrats do!", "label": 1, "succ": "", "meta": "", "user": "ILoveHostagesBiden", "mentions": "", "prev": ""}
{"title": "Don't buy media hype on Newsom's gun ban, it won't work: Constitutional scholar", "text": "Another liberal move to keep their Plantation subjects in control. ", "label": 1, "succ": "", "meta": "", "user": "Joanna318", "mentions": "", "prev": ""}
{"title": "Don't buy media hype on Newsom's gun ban, it won't work: Constitutional scholar", "text": "Not buying the hype but we should still file a lawsuit against Newsome for the emotional distress and PTSD he is causing people by threatning us with financial and physical harm.", "label": 0, "succ": "", "meta": "", "user": "chinawantstoruletheworld", "mentions": "", "prev": ""}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "As a patient, would you rather have the most diverse doctor or the one who graduated top of his class. Just saying.", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Great. But as evidenced by our politicians and institutions, diverse is not necessarily better or improving.", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "this is clearly foolish. It will just lead to more female doctors", "label": 1}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Underperforming students from underperforming schools coming soon to hospitals and clinics near you!!", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "That is fine just as long as they didn't get affirmative action points simply because of their diversity and lowered standards in the name of inclusion at the expense of others in the admission process.", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "You should have quit that Yo MTV raps doctor  I feel sorry for you.", "label": 1}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Diversity and inclusion need to start at the beginning of the race, not at the end.  Medical training, and especially surgical training, are at the pinnacle of education.  It is more important to train the best and brightest rather than train those based on gender and/or race.  Entrance into medical school and into residency training programs should be entirely color blind.  Patients deserve the best, regardless of background.  If the entering class is the most diverse it has ever been, that is great, so long as these principles have not been overlooked.", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Most diverse class unfortunately means they lowered the standards. There are some things that require an extremely high level of standard and medicine is one of them. We will have a bunch of doctors not being the best and brightest, but they can shout diversity!", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Do you really think they would wash out any black student?! Prepare for quota-picks to flood the system! ", "label": 1}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "And what is your specialty? Black trans female lesbian blind dwarf neurosurgery.", "label": 1}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Then get ready for a whole new bunch of lazy incompetents Affirmative action quacks.", "label": 1}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "this will just lead to lots of blacks, women, and attack helicopters being admitted...", "label": 1}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Does their introduction include how to have an Indian accent?", "label": 1}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "they take about 2% white people, thats why our health care system is so fucked. college degree in some garbage curry school in India, and free medical school in America, when a white American graduates with a 4.0 from a major college, gets denied. ", "label": 1}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Yeah....if you're white and want to go to medical school good luck with that. Have the Ns go to the N medical schools...that's why they're there.", "label": 1}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Great now no more trips to the hospital  or doctor. These idiot people still don't know the metric system and count with their hands and feet", "label": 1}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "God help us all. In 5 to 10 years will have a new crop of doctors that are stupid incompetent and diverse.", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Lower the standards to prevent the mass dropouts. Watch!  Ill get the popcorn. Equity admissions drop out unequally.", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Quality be damned! We want diversity?", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Now you know why patient care and medicine today are a joke.", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "applicants were very concerned with issues of equity and justice - I prefer my doctor to be very concerned about health and science.  My guess is the standards have been lowered and quotas imposed - appears to be the beginning of the end of good medicine in the US.", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "I hope they were picked because they were the best and smartest and not because of there color or gender.  FJB", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Did they lower standards for POC?", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "I'm sure this entails a major dumbing down of entrance and certification requirements for POC", "label": 1}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "In a few years life expectancy will go down even lower... thanks Obama ... FJB", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Yes. Thank you Obama. Anybody  been to the doctor lately. They've all been replaced by Dr. Diversity.", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "I have found that new doctors are no more than a referral service to the specialists.", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Yea for health care going down even more in this county! All thanks to a ridiculous political movement by lying AOC and sleepy JB on white American soil", "label": 1}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "Lowering the bar in the name of diversity, the race to the bottom continues.", "label": 0}
{"title": "US medical schools enrolled the largest and most diverse class in history in 2021", "text": "There will never be racial equality if government continues  to stoke racism by sorting people by skin color. Why can’t we just have people, or in this case students?", "label": 0}
{"title": "Ravens' Lamar Jackson goes down with ankle injury", "text": "you sure it wasn't his knee?", "label": 1}
{"title": "Ravens' Lamar Jackson goes down with ankle injury", "text": "Take a knee dawg.", "label": 1}
{"title": "Brazen smash-and-grab suspects loot Chicago exotic store, steal millions in in merchandise", "text": "Sorry but these people (collectively) are getting what they wanted, and in 2022/2024, they will continue to elect people that enable this behavior.  i feel for those who try to vote their conscience and are caught in the crossfire, but nothing will change and how the electorate support this through their votes this is beyond me.", "label": 0}
{"title": "Brazen smash-and-grab suspects loot Chicago exotic store, steal millions in in merchandise", "text": "I predict there won’t be anymore high end retail stores around much longer.  They can’t keep up with this and insurance companies won’t continue to pay out.", "label": 0}
{"title": "Brazen smash-and-grab suspects loot Chicago exotic store, steal millions in in merchandise", "text": "I live a few hours drive away from Chicago; we used to go there for weekend getaways to enjoy the museums and food. You couldn't pay us to go there now. We take our business elsewhere. ", "label": 0}
{"title": "Brazen smash-and-grab suspects loot Chicago exotic store, steal millions in in merchandise", "text": "So, according to beetlejuice, retailers should spend hundreds of thousands of dollars a year for  security officers?  What about the hundreds of thousands retailers pay in taxes to hire police officers that she won't let do their jobs, or court systems that keep letting them out?", "label": 1}
{"title": "Brazen smash-and-grab suspects loot Chicago exotic store, steal millions in in merchandise", "text": "In this case, someone with a gun, whether it's raised or not, is a viable threat to you.  Waiting until he raised it would have been disastrous.  Dropping him where he stood would have been the better choice.", "label": 0}
{"title": "Brazen smash-and-grab suspects loot Chicago exotic store, steal millions in in merchandise", "text": "Can I get an N Pat? I’d like to solve the puzzle", "label": 1}
{"title": "Brazen smash-and-grab suspects loot Chicago exotic store, steal millions in in merchandise", "text": "Now Democrats in Pennsylvania are complaining about the forensic audit being performed there.  If the Democrats were confident with the results of the 2020 Election they would welcome audits in their states. A couple weeks ago on November 21 a firm had been chosen by Republicans in the Pennsylvania Senate to perform a forensic audit of the 2020 Election results in the state. Now the corrupt Democrat Attorney General, Josh Shapiro in Pennsylvania is complaining and trying to muddy up the audit that has just started. It’s a violation of your privacy, and I’m suing to stop them. Corrupt AG Shapiro called the Pennsylvania election for Biden before the election took place. Shapiro then ignored the hundreds and thousands of complaints, some with supporting affidavits, that notified public officials like Shapiro of massive fraud in the state.  Yet Shapiro did nothing. A registered Democrat and poll watcher at the Philadelphia Convention Center overseeing ballot counters detailed corruption at the highest levels in the city of Philadelphia. They will not allow us within 30 to 100 feet to supervise the ballots being counted, poll watcher Brian Mchafferty said. This is a coup against the President of the United States of America and I want to call out the Mayor of Philadelphia, James Kenny…the Attorney General Josh Shapiro who tweeted that there was no way that Donald Trump would win president of the United States of America.", "label": 0}
{"title": "Fauci: Americans may 'just have to deal with' more COVID boosters", "text": "I had the antibodies test and tested positive for antibodies. So why do I need the third jab? Did management at big pharmacy companies all buy new boats?", "label": 0}
{"title": "Fauci: Americans may 'just have to deal with' more COVID boosters", "text": "My fully vaccinated mother in law passed away from Covid. My wife and I both got Covid. One vaccinated one not. We recovered at the same time. I now am full of antibodies better than that vaccine ever produced. No more vaccine for me. I got over it in 8 days. Waited the full 10 before I went out.", "label": 0}
{"title": "Fauci: Americans may 'just have to deal with' more COVID boosters", "text": "Nope-not going to do it. My employer can fire me then because I refuse a booster. ", "label": 0}
{"title": "Fauci: Americans may 'just have to deal with' more COVID boosters", "text": "I’m just wondering if anyone has considered that as humans our bodies are built with a mutual ability to develop immunity through exposure. If we continue to circumvent that system and purposely inject a lab developed substance to alter our cells will we all become dependent on such and lose the natural ability to fight other things?  ", "label": 0}
{"title": "Fauci: Americans may 'just have to deal with' more COVID boosters", "text": "my response: FJB and the rotten liberals who have prolonged this pandemic through POC greed", "label": 1}
{"title": "Fauci: Americans may 'just have to deal with' more COVID boosters", "text": "Get used to me not getting boosters.", "label": 0}
{"title": "Fauci: Americans may 'just have to deal with' more COVID boosters", "text": "No way, FauXi!", "label": 0}
{"title": "First lady Jill Biden dismisses concerns about president's mental fitness: 'Ridiculous'", "text": "Joe is so far gone he confessed to Jill that he nailed another broad behind her back last night. Jill had to inform him that he was actually nailing her. Poor Joe.", "label": 1}
{"title": "First lady Jill Biden dismisses concerns about president's mental fitness: 'Ridiculous'", "text": "We have loads of real problems in this country.  Joe, Jill and Kamala are busy trying to fix their image and falling poll numbers.  Nice!", "label": 0}
{"title": "First lady Jill Biden dismisses concerns about president's mental fitness: 'Ridiculous'", "text": "Jill is disappointing.  She is ether in denial or unethical like Joe.  If she can’t acknowledge that Joe is mentally impaired she has major issues.  Jill should have protected Joe from running for president as  he exhibited mental impairment during his campaign and he has declined. Very sad.", "label": 0}
{"title": "First lady Jill Biden dismisses concerns about president's mental fitness: 'Ridiculous'", "text": "Let's go Branden!!! Let's go Bernadette!!!", "label": 1}
{"title": "First lady Jill Biden dismisses concerns about president's mental fitness: 'Ridiculous'", "text": "She is to blame. She knows better. His doctors are to blame. They know better. Once his handlers and the media are done with him. It's over. Worst kept secret. Other than that, I have no opinion.", "label": 0}
{"title": "First lady Jill Biden dismisses concerns about president's mental fitness: 'Ridiculous'", "text": "Tali-Biden is a figurehead.  Soros and others are running this country.", "label": 1}
{"title": "First lady Jill Biden dismisses concerns about president's mental fitness: 'Ridiculous'", "text": "Hunter will hook up with her, shortly!", "label": 1}
{"title": "First lady Jill Biden dismisses concerns about president's mental fitness: 'Ridiculous'", "text": "They are perfect for each other - they both have no integrity.", "label": 0}
{"title": "High-profile Houston Democrats face corruption allegations", "text": "If all Democrats were investigated, the majority would be charged with corruption.  The Democrats are protected by the MSM which allows them to govern unchecked and promotes corruption.  Look at Democratic led cities, they are a war zone.  The Democrats feel they can get away with anything.", "label": 0}
{"title": "High-profile Houston Democrats face corruption allegations", "text": "No surprise there. The Dems didn’t become the party of the rich by working hard.", "label": 0}
{"title": "High-profile Houston Democrats face corruption allegations", "text": "Expect nothing less from DemocRATS. The laws or for thee, not for them.", "label": 0}
{"title": "High-profile Houston Democrats face corruption allegations", "text": "Are there any democrats who are not corrupt?", "label": 0}
{"title": "High-profile Houston Democrats face corruption allegations", "text": "Exactly cholo ", "label": 1}
{"title": "Biden dismisses criticism of Afghanistan withdrawal, repeats lie about war", "text": "When the news broke about the people trying to escape Afghanistan my 12 yo daughter said “ why didn’t we get them out before we left?”  That’s right Joe. My 12 yo daughter is smarter than you and evidently smarter than those few who voted for you.", "label": 0}
{"title": "Biden dismisses criticism of Afghanistan withdrawal, repeats lie about war", "text": "What does it say when a career NY business man is vastly more competent at politics and government than a career politician?", "label": 0}
{"title": "Biden dismisses criticism of Afghanistan withdrawal, repeats lie about war", "text": "The spineless creep tried several times to blame Trump by saying the withdrawal date was etched in stone. It wasn't. It was totally arbitrary and Biden could have changed it saving many lives.", "label": 0}
{"title": "Biden dismisses criticism of Afghanistan withdrawal, repeats lie about war", "text": "Liberal lemmings... explain to the class why your overlord Fuhrer House Plant ABANDONED so many American citizens and $85 BILLION in military equipment? Explain that debacle if you've got the sack.", "label": 1}
